app/views/users/show.html.erb

SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = ? ORDER BY "posts"."created_at" DESC  [["user_id", 7]]
---

    <% @user.posts.each do |post| %>