app/views/posts/show.html.erb

SELECT  "likes".* FROM "likes" WHERE "likes"."user_id" = ? AND "likes"."post_id" = ? LIMIT ?  [["user_id", 8], ["post_id", 13], ["LIMIT", 1]]
---
      <% end %>
      <% if Like.find_by(user_id: @current_user, post_id: @post.id) %>