app/controllers/likes_controller.rb

INSERT INTO "likes" ("user_id", "post_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 6], ["post_id", 1], ["created_at", "2020-03-24 00:15:22.620545"], ["updated_at", "2020-03-24 00:15:22.620545"]]
---
    def create
      @like = Like.new(user_id: @current_user.id, post_id: params[:post_id])
      @like.save

SELECT  "likes".* FROM "likes" WHERE "likes"."user_id" = ? AND "likes"."post_id" = ? LIMIT ?  [["user_id", 6], ["post_id", 1], ["LIMIT", 1]]
DELETE FROM "likes" WHERE "likes"."id" = ?  [["id", 1]]
---
    def destroy
      @like = Like.find_by(user_id: @current_user.id, post_id:params[:post_id])
      @like.destroy