app/controllers/posts_controller.rb

  def index
    @posts = Post.where(post_info: 1).order(created_at: :desc)
---
SELECT "posts".* FROM "posts" WHERE "posts"."post_info" = ? AND "posts"."created_at" = ?  [["post_info", 1], ["created_at", "desc"]]

  def show
    @post = Post.find_by(id: params[:id])
    @user = @post.user
    @likes_count = Like.where(post_id: @post.id).count
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 13], ["LIMIT", 1]]
SELECT COUNT(*) FROM "likes" WHERE "likes"."post_id" = ?  [["post_id", 13]]

  def create
    @post = Post.new(
      title: params[:title],
      fact: params[:fact],
      abstraction: params[:abstraction],
      diversion: params[:diversion],
      post_info: params[:post_info],
      user_id: @current_user.id)
    if @post.save
---
INSERT INTO "posts" ("title", "fact", "abstraction", "diversion", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?)  [["title", "非公開メモ"], ["fact", ""], ["abstraction", ""], ["diversion", ""], ["created_at", "2020-03-26 03:23:03.405583"], ["updated_at", "2020-03-26 03:23:03.405583"], ["user_id", 7]]

  def update
    @post = Post.find_by(id: params[:id])
    @post.title = params[:title]
    @post.fact = params[:fact]
    @post.abstraction = params[:abstraction]
    @post.diversion = params[:diversion]
    @post.post_info = params[:post_info]
    if @post.save
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 12], ["LIMIT", 1]]
UPDATE "posts" SET "title" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["title", "公開するメモ"], ["updated_at", "2020-03-26 02:49:28.326557"], ["id", 12]]

  def ensure_correct_user
    @post = Post.find_by(id: params[:id])
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 13], ["LIMIT", 1]]

  def post_info_correct_user
    @post = Post.find_by(id: params[:id])
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]