app/controllers/users_controller.rb

  def create
    @user = User.new(name: params[:name], email: params[:email], password: params[:password])
    if @user.save
---
INSERT INTO "users" ("name", "email", "created_at", "updated_at", "password_digest") VALUES (?, ?, ?, ?, ?)

  def update
    @user = User.find_by(id: params[:id])
    @user.name = params[:name]
    @user.email = params[:email]
    if params[:image]
        @user.image_name = "#{@user.id}.jpg"
        image = params[:image]
        File.binwrite("public/user_images/#{@user.image_name}", image.read)
    end
    if @user.save
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
UPDATE "users" SET "image_name" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["image_name", "6.jpg"], ["updated_at", "2020-03-24 00:16:54.782584"], ["id", 6]]